app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2023-06-01 14:09:32.170654"], ["id", 1]]
---
  def show
    @email = Email.find(params[:id])
    @email.update(read: true)

INSERT INTO "emails" ("object", "body", "read", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @email = Email.new(object: Faker::Food.dish,
                      body: Faker::Food.description,
                      read: false)
    @email.save